W7D3/music_app/app/models/user.rb

INSERT INTO "users" ("email", "password_digest", "session_token", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"
UPDATE "users" SET "session_token" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["session_token", "i-QphRbbPGfsCHEEItV_hg"], ["updated_at", "2021-02-09 19:16:51.450337"], ["id", 1]]
---
    def reset_session_token!
        self.session_token = User.generate_session_token
        self.save!